DROP table if exists `mdx_passport`;
CREATE TABLE `mdx_passport` (
`id` int(11) unsigned NOT NULL AUTO_INCREMENT,
`phone` bigint(11) unsigned NOT NULL DEFAULT '0' COMMENT '注册手机号',
`email` varchar(100) NOT NULL DEFAULT '' COMMENT '关联邮箱',
`password` char(24) NOT NULL DEFAULT '' COMMENT '登录密码',
`second_password` char(24) NOT NULL DEFAULT '' COMMENT '二级密码',
`source` varchar(32) NOT NULL DEFAULT '0' COMMENT '用户来源，1:weixin，2:web，3:ios8.1，4:facebook',
`ip` char(15) NOT NULL DEFAULT '' COMMENT '注册ip',
`status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '账号状态：1正常，0锁定，－1注销',
`log_msg` varchar(100) NOT NULL DEFAULT '' COMMENT '登陆后提示信息，防止钓鱼网站',
`last_time` int(11) NOT NULL DEFAULT '0' COMMENT '上次登录时间',
`create_time` int(11) NOT NULL DEFAULT '0' COMMENT '账号创建时间',
`update_time` int(11) NOT NULL DEFAULT '0' COMMENT '用户信息最后更新时间，更新前需入快照表',
PRIMARY KEY (`id`),
UNIQUE KEY `uk_phone` (`phone`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='用户登录信息表';


DROP table if exists `mdx_account`;
CREATE TABLE `mdx_account` (
`id` int(11) unsigned NOT NULL AUTO_INCREMENT,
`passport_id` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '用户passport id，关联passport库',
`balance` decimal(11,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '账户资金',
`frozen` decimal(11,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '冻结金额',
`income` decimal(11,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '总收入，包括充值、回款、货基收益等',
`expend` decimal(11,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '总支出，包括提现、投资',
`profit` decimal(11,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '总收益，包括回款、货基收益等但不包括充值',
`create_time` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
`update_time` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '最后更新时间，更新前需入快照表',
PRIMARY KEY (`id`),
UNIQUE KEY `uk_user_id` (`passport_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='用户财务表';


DROP TABLE IF EXISTS `mdx_account_auth`;
CREATE TABLE `mdx_account_auth` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `account_id` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '用户account id',
  `id_number` varchar(50) NOT NULL DEFAULT '' COMMENT '身份证号或者机构id，需加密',
  `name` varchar(100) DEFAULT '' COMMENT '姓名，需加密',
  `sex` tinyint(1) DEFAULT '1' COMMENT '性别 1:男 2：女 0：未知',
  `auth_provider` varchar(32) NOT NULL DEFAULT '' COMMENT '认证方',
  `auth_user_number` varchar(50) NOT NULL COMMENT '汇付用户编号',
  `auth_user_pwd` varchar(32) NOT NULL COMMENT '汇付操作密码（需加密）',
  `status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '认证状态：1通过，0未认证，－1认证失败',
  `auth_time` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '认证通过时间',
  `create_time` int(11) unsigned NOT NULL DEFAULT '0',
  `update_time` int(11) NOT NULL COMMENT '修改时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_account_id` (`account_id`),
  UNIQUE KEY `uk_id_number` (`id_number`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COMMENT='用户认证信息表';


DROP TABLE IF EXISTS `mdx_pnrpay_error`;
CREATE TABLE `mdx_pnrpay_error` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `account_id` int(4) NOT NULL COMMENT '用户id',
  `error_msg` varchar(100) NOT NULL COMMENT '错误信息',
  `org_data` text NOT NULL COMMENT '原数据',
  `create_time` int(11) NOT NULL COMMENT '创建时间',
  `update_time` int(11) NOT NULL COMMENT '修改时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1 DEFAULT CHARSET=utf8;


DROP TABLE IF EXISTS `mdx_account_bank`;
CREATE TABLE `mdx_account_bank` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `account_id` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '用户account id',
  `bank_id` int(4) unsigned NOT NULL DEFAULT '0' COMMENT '银行id',
  `bank_city_id` int(4) NOT NULL COMMENT '银行所属地id',
  `card_no` varchar(64) NOT NULL COMMENT '银行卡号',
  `account_name` varchar(64) NOT NULL DEFAULT '' COMMENT '银行开户名，加密',
  `bank_phone` varchar(64) NOT NULL DEFAULT '' COMMENT '银行绑定手机号，加密',
  `type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '1:充值卡，2:取现卡 0:不限',
  `pay_card_id` int(11) unsigned DEFAULT NULL COMMENT '支付方设定的绑定银行卡对应的id',
  `card_attr` tinyint(4) NOT NULL DEFAULT '1' COMMENT '银行卡属性，1对私，2对公',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '绑卡状态：-1删除，0未验证，1已验证',
  `notify_data` text NOT NULL COMMENT '异步通知数据',
  `create_time` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  `update_time` int(11) NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1 DEFAULT CHARSET=utf8 COMMENT='用户银行绑卡信息表';


DROP TABLE IF EXISTS `mdx_bank_code`;
CREATE TABLE `mdx_bank_code` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `bank_code` varchar(20) CHARACTER SET utf8 NOT NULL,
  `bank_name` varchar(50) CHARACTER SET utf8 NOT NULL,
  `logo` varchar(20) CHARACTER SET utf8 NOT NULL COMMENT '银行图标',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='银行信息表';

BEGIN;
INSERT INTO `mdx_bank_code` VALUES ('1', '01020000', '中国工商银行', 'ICBC.png'), ('2', '01030000', '中国农业银行', 'ABC.png'), ('3', '01040000', '中国银行', 'BC.png'), ('4', '01050000', '中国建设银行', 'CBC.png'), ('5', '02010000', '国家开发银行', ''), ('6', '02020000', '中国进出口银行', ''), ('7', '02030000', '中国农业发展银行', ''), ('8', '03010000', '交通银行', 'JTB.png'), ('9', '03020000', '中信银行', 'ZXB.png'), ('10', '03030000', '中国光大银行', 'CEB.png'), ('11', '03040000', '华夏银行', 'HXB.png'), ('12', '03050000', '中国民生银行', 'CMBC.png'), ('13', '03060000', '广发银行', ''), ('14', '03070000', '深圳发展银行', ''), ('15', '03080000', '招商银行', 'CMB.png'), ('16', '03090000', '兴业银行', 'CIB.png'), ('17', '03100000', '上海浦东发展银行', 'PFB.png'), ('18', '03130011', '北京银行', ''), ('19', '03130012', '天津银行', ''), ('20', '03130031', '上海银行', ''), ('21', '03130032', '江苏银行', ''), ('22', '03130050', '重庆银行', ''), ('23', '03132101', '盛京银行', ''), ('24', '03132102', '大连银行', ''), ('25', '03132301', '哈尔滨银行', ''), ('26', '03133201', '南京银行', ''), ('27', '03133301', '杭州银行', ''), ('28', '03133302', '宁波银行', ''), ('29', '03133305', '浙江稠州商业银行', ''), ('30', '03133307', '浙江民泰商业银行', ''), ('31', '03133308', '温州银行', ''), ('32', '03133702', '青岛银行', ''), ('33', '03133710', '临商银行', ''), ('34', '03133715', '烟台银行', ''), ('35', '03133717', '齐商银行', ''), ('36', '03134106', '洛阳银行', ''), ('37', '03134201', '汉口银行', ''), ('38', '03134401', '广州银行', ''), ('39', '03134402', '平安银行', ''), ('40', '03134404', '东莞银行', ''), ('41', '03136501', '乌鲁木齐商业银行', ''), ('42', '03139999', '城市商业银行', ''), ('43', '03140000', '农村商业银行', ''), ('44', '03143206', '张家港农村商业银行', ''), ('45', '03150000', '恒丰银行', ''), ('46', '03160000', '浙商银行', ''), ('47', '03170000', '农村合作银行', ''), ('48', '03180000', '渤海银行', ''), ('49', '03190000', '徽商银行', ''), ('50', '04010000', '城市信用合作社', ''), ('51', '04020000', '农村信用合作社', ''), ('52', '04020011', '北京农村商业银行', ''), ('53', '04020031', '上海农村商业银行', ''), ('54', '04024402', '深圳农村商业银行', ''), ('55', '04030000', '中国邮政储蓄银行', ''), ('56', '05010000', '汇丰银行', ''), ('57', '05040000', '恒生银行', ''), ('58', '07750000', '华美银行', ''), ('59', '07813501', '厦门国际银行', ''), ('60', '31320000', '锦州银行', ''), ('61', '32165000', '重庆三峡银行', ''), ('62', '50210000', '东亚银行', '');
COMMIT;

DROP TABLE IF EXISTS `mdx_province_city`;
CREATE TABLE `mdx_province_city` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `province_code` varchar(10) CHARACTER SET utf8 NOT NULL COMMENT '省份编号',
  `province_name` varchar(20) CHARACTER SET utf8 NOT NULL COMMENT '省份名称',
  `city_code` varchar(10) CHARACTER SET utf8 NOT NULL COMMENT '城市编码',
  `city_name` varchar(20) CHARACTER SET utf8 NOT NULL COMMENT '城市名称',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COMMENT='省份城市表';

BEGIN;
INSERT INTO `mdx_province_city` VALUES ('1', '0011', '北京', '1100', '北京'), ('2', '0012', '天津', '1200', '天津'), ('3', '0013', '河北', '1301', '石家庄'), ('4', '0013', '河北', '1302', '保定'), ('5', '0013', '河北', '1303', '沧州'), ('6', '0013', '河北', '1304', '承德'), ('7', '0013', '河北', '1305', '邯郸'), ('8', '0013', '河北', '1306', '衡水'), ('9', '0013', '河北', '1307', '廊坊'), ('10', '0013', '河北', '1308', '秦皇岛'), ('11', '0013', '河北', '1309', '唐山'), ('12', '0013', '河北', '1310', '邢台'), ('13', '0013', '河北', '1311', '张家口'), ('14', '0014', '山西', '1401', '太原'), ('15', '0014', '山西', '1402', '长治'), ('16', '0014', '山西', '1403', '大同'), ('17', '0014', '山西', '1404', '晋城'), ('18', '0014', '山西', '1405', '离石'), ('19', '0014', '山西', '1406', '临汾'), ('20', '0014', '山西', '1407', '朔州'), ('21', '0014', '山西', '1408', '忻州'), ('22', '0014', '山西', '1409', '阳泉'), ('23', '0014', '山西', '1410', '榆次'), ('24', '0014', '山西', '1411', '运城'), ('25', '0014', '山西', '1412', '晋中'), ('26', '0014', '山西', '1413', '吕梁'), ('27', '0015', '内蒙古', '1501', '呼和浩特'), ('28', '0015', '内蒙古', '1502', '包头'), ('29', '0015', '内蒙古', '1503', '阿拉善'), ('30', '0015', '内蒙古', '1504', '巴彦淖尔'), ('31', '0015', '内蒙古', '1505', '赤峰'), ('32', '0015', '内蒙古', '1506', '呼伦贝尔'), ('33', '0015', '内蒙古', '1507', '乌海'), ('34', '0015', '内蒙古', '1508', '乌兰察布'), ('35', '0015', '内蒙古', '1509', '锡林郭勒'), ('36', '0015', '内蒙古', '1510', '兴安'), ('37', '0015', '内蒙古', '1511', '鄂尔多斯'), ('38', '0015', '内蒙古', '1512', '通辽'), ('39', '0021', '辽宁', '2101', '沈阳'), ('40', '0021', '辽宁', '2102', '大连'), ('41', '0021', '辽宁', '2103', '鞍山'), ('42', '0021', '辽宁', '2104', '本溪'), ('43', '0021', '辽宁', '2105', '朝阳'), ('44', '0021', '辽宁', '2106', '丹东'), ('45', '0021', '辽宁', '2107', '抚顺'), ('46', '0021', '辽宁', '2108', '阜新'), ('47', '0021', '辽宁', '2109', '葫芦岛'), ('48', '0021', '辽宁', '2110', '锦州'), ('49', '0021', '辽宁', '2111', '辽阳'), ('50', '0021', '辽宁', '2112', '盘锦'), ('51', '0021', '辽宁', '2113', '铁岭'), ('52', '0021', '辽宁', '2114', '营口'), ('53', '0022', '吉林', '2201', '长春'), ('54', '0022', '吉林', '2202', '白城'), ('55', '0022', '吉林', '2203', '白山'), ('56', '0022', '吉林', '2204', '吉林'), ('57', '0022', '吉林', '2205', '辽源'), ('58', '0022', '吉林', '2206', '四平'), ('59', '0022', '吉林', '2207', '松原'), ('60', '0022', '吉林', '2208', '通化'), ('61', '0022', '吉林', '2209', '延边'), ('62', '0023', '黑龙江', '2301', '哈尔滨'), ('63', '0023', '黑龙江', '2302', '大庆'), ('64', '0023', '黑龙江', '2303', '大兴安岭'), ('65', '0023', '黑龙江', '2304', '鹤岗'), ('66', '0023', '黑龙江', '2305', '黑河'), ('67', '0023', '黑龙江', '2306', '鸡西'), ('68', '0023', '黑龙江', '2307', '佳木斯'), ('69', '0023', '黑龙江', '2308', '牡丹江'), ('70', '0023', '黑龙江', '2309', '七台河'), ('71', '0023', '黑龙江', '2310', '齐齐哈尔'), ('72', '0023', '黑龙江', '2311', '双鸭山'), ('73', '0023', '黑龙江', '2312', '绥化'), ('74', '0023', '黑龙江', '2313', '伊春'), ('75', '0031', '上海', '3100', '上海'), ('76', '0032', '江苏', '3201', '南京'), ('77', '0032', '江苏', '3202', '常州'), ('78', '0032', '江苏', '3203', '淮安'), ('79', '0032', '江苏', '3204', '连云港'), ('80', '0032', '江苏', '3205', '南通'), ('81', '0032', '江苏', '3206', '苏州'), ('82', '0032', '江苏', '3207', '宿迁'), ('83', '0032', '江苏', '3208', '泰州'), ('84', '0032', '江苏', '3209', '无锡'), ('85', '0032', '江苏', '3210', '徐州'), ('86', '0032', '江苏', '3211', '盐城'), ('87', '0032', '江苏', '3212', '扬州'), ('88', '0032', '江苏', '3213', '镇江'), ('89', '0032', '江苏', '3214', '胥浦'), ('90', '0033', '浙江', '3301', '杭州'), ('91', '0033', '浙江', '3302', '宁波'), ('92', '0033', '浙江', '3303', '湖州'), ('93', '0033', '浙江', '3304', '嘉兴'), ('94', '0033', '浙江', '3305', '金华'), ('95', '0033', '浙江', '3306', '绍兴'), ('96', '0033', '浙江', '3307', '台州'), ('97', '0033', '浙江', '3308', '温州'), ('98', '0033', '浙江', '3309', '舟山'), ('99', '0033', '浙江', '3310', '衢州'), ('100', '0033', '浙江', '3311', '丽水'), ('101', '0034', '安徽', '3401', '合肥'), ('102', '0034', '安徽', '3402', '安庆'), ('103', '0034', '安徽', '3403', '蚌埠'), ('104', '0034', '安徽', '3404', '巢湖'), ('105', '0034', '安徽', '3405', '池州'), ('106', '0034', '安徽', '3406', '滁州'), ('107', '0034', '安徽', '3407', '阜阳'), ('108', '0034', '安徽', '3408', '淮北'), ('109', '0034', '安徽', '3409', '淮南'), ('110', '0034', '安徽', '3410', '黄山'), ('111', '0034', '安徽', '3411', '六安'), ('112', '0034', '安徽', '3412', '马鞍山'), ('113', '0034', '安徽', '3414', '铜陵'), ('114', '0034', '安徽', '3415', '芜湖'), ('115', '0034', '安徽', '3416', '宣城'), ('116', '0034', '安徽', '3417', '亳州'), ('117', '0034', '安徽', '3418', '宿州'), ('118', '0035', '福建', '3501', '福州'), ('119', '0035', '福建', '3502', '厦门'), ('120', '0035', '福建', '3503', '龙岩'), ('121', '0035', '福建', '3504', '南平'), ('122', '0035', '福建', '3505', '宁德'), ('123', '0035', '福建', '3506', '莆田'), ('124', '0035', '福建', '3507', '泉州'), ('125', '0035', '福建', '3508', '三明'), ('126', '0035', '福建', '3509', '漳州'), ('127', '0036', '江西', '3601', '南昌'), ('128', '0036', '江西', '3602', '抚州'), ('129', '0036', '江西', '3603', '赣州'), ('130', '0036', '江西', '3604', '吉安'), ('131', '0036', '江西', '3605', '景德镇'), ('132', '0036', '江西', '3606', '九江'), ('133', '0036', '江西', '3607', '萍乡'), ('134', '0036', '江西', '3608', '上饶'), ('135', '0036', '江西', '3609', '新余'), ('136', '0036', '江西', '3610', '宜春'), ('137', '0036', '江西', '3611', '鹰潭'), ('138', '0037', '山东', '3701', '济南'), ('139', '0037', '山东', '3702', '青岛'), ('140', '0037', '山东', '3703', '滨州'), ('141', '0037', '山东', '3704', '德州'), ('142', '0037', '山东', '3705', '东营'), ('143', '0037', '山东', '3706', '菏泽'), ('144', '0037', '山东', '3707', '济宁'), ('145', '0037', '山东', '3708', '莱芜'), ('146', '0037', '山东', '3709', '聊城'), ('147', '0037', '山东', '3710', '临沂'), ('148', '0037', '山东', '3711', '日照'), ('149', '0037', '山东', '3712', '泰安'), ('150', '0037', '山东', '3713', '威海'), ('151', '0037', '山东', '3714', '潍坊'), ('152', '0037', '山东', '3715', '烟台'), ('153', '0037', '山东', '3716', '枣庄'), ('154', '0037', '山东', '3717', '淄博'), ('155', '0041', '河南', '4101', '郑州'), ('156', '0041', '河南', '4102', '安阳'), ('157', '0041', '河南', '4103', '焦作'), ('158', '0041', '河南', '4104', '鹤壁'), ('159', '0041', '河南', '4105', '开封'), ('160', '0041', '河南', '4106', '洛阳'), ('161', '0041', '河南', '4107', '南阳'), ('162', '0041', '河南', '4108', '平顶山'), ('163', '0041', '河南', '4109', '三门峡'), ('164', '0041', '河南', '4110', '商丘'), ('165', '0041', '河南', '4111', '新乡'), ('166', '0041', '河南', '4112', '信阳'), ('167', '0041', '河南', '4113', '许昌'), ('168', '0041', '河南', '4114', '周口'), ('169', '0041', '河南', '4115', '驻马店'), ('170', '0041', '河南', '4116', '漯河'), ('171', '0041', '河南', '4117', '濮阳'), ('172', '0041', '河南', '4118', '济源'), ('173', '0042', '湖北', '4201', '武汉'), ('174', '0042', '湖北', '4202', '鄂州'), ('175', '0042', '湖北', '4203', '恩施'), ('176', '0042', '湖北', '4204', '黄冈'), ('177', '0042', '湖北', '4205', '黄石'), ('178', '0042', '湖北', '4206', '荆门'), ('179', '0042', '湖北', '4207', '荆州'), ('180', '0042', '湖北', '4208', '十堰'), ('181', '0042', '湖北', '4209', '随州'), ('182', '0042', '湖北', '4210', '咸宁'), ('183', '0042', '湖北', '4211', '襄樊'), ('184', '0042', '湖北', '4212', '孝感'), ('185', '0042', '湖北', '4213', '神农架'), ('186', '0042', '湖北', '4214', '天门'), ('187', '0042', '湖北', '4215', '宜昌'), ('188', '0042', '湖北', '4216', '三峡'), ('189', '0043', '湖南', '4301', '长沙'), ('190', '0043', '湖南', '4302', '常德'), ('191', '0043', '湖南', '4303', '郴州'), ('192', '0043', '湖南', '4304', '衡阳'), ('193', '0043', '湖南', '4305', '怀化'), ('194', '0043', '湖南', '4306', '娄底'), ('195', '0043', '湖南', '4307', '邵阳'), ('196', '0043', '湖南', '4308', '湘潭'), ('197', '0043', '湖南', '4309', '湘西'), ('198', '0043', '湖南', '4310', '益阳'), ('199', '0043', '湖南', '4311', '永州'), ('200', '0043', '湖南', '4312', '岳阳'), ('201', '0043', '湖南', '4313', '张家界'), ('202', '0043', '湖南', '4314', '株洲'), ('203', '0044', '广东', '4401', '广州'), ('204', '0044', '广东', '4402', '深圳'), ('205', '0044', '广东', '4403', '潮州'), ('206', '0044', '广东', '4404', '东莞'), ('207', '0044', '广东', '4405', '佛山'), ('208', '0044', '广东', '4406', '惠州'), ('209', '0044', '广东', '4407', '江门'), ('210', '0044', '广东', '4408', '揭阳'), ('211', '0044', '广东', '4409', '茂名'), ('212', '0044', '广东', '4410', '梅州'), ('213', '0044', '广东', '4411', '清远'), ('214', '0044', '广东', '4412', '汕头'), ('215', '0044', '广东', '4413', '汕尾'), ('216', '0044', '广东', '4414', '韶关'), ('217', '0044', '广东', '4415', '阳江'), ('218', '0044', '广东', '4416', '云浮'), ('219', '0044', '广东', '4417', '湛江'), ('220', '0044', '广东', '4418', '肇庆'), ('221', '0044', '广东', '4419', '中山'), ('222', '0044', '广东', '4420', '河源'), ('223', '0044', '广东', '4421', '珠海'), ('224', '0045', '广西', '4501', '南宁'), ('225', '0045', '广西', '4502', '百色'), ('226', '0045', '广西', '4503', '北海'), ('227', '0045', '广西', '4504', '桂林'), ('228', '0045', '广西', '4505', '河池'), ('229', '0045', '广西', '4506', '柳州'), ('230', '0045', '广西', '4507', '梧州'), ('231', '0045', '广西', '4508', '玉林'), ('232', '0045', '广西', '4509', '崇左'), ('233', '0045', '广西', '4510', '防城港'), ('234', '0045', '广西', '4511', '贵港'), ('235', '0045', '广西', '4512', '贺州'), ('236', '0045', '广西', '4513', '来宾'), ('237', '0045', '广西', '4514', '钦州'), ('238', '0046', '海南', '4601', '海口'), ('239', '0046', '海南', '4602', '三亚'), ('240', '0046', '海南', '4603', '白沙'), ('241', '0046', '海南', '4604', '保亭'), ('242', '0046', '海南', '4605', '昌江'), ('243', '0046', '海南', '4606', '澄迈'), ('244', '0046', '海南', '4607', '儋州'), ('245', '0046', '海南', '4608', '定安'), ('246', '0046', '海南', '4609', '东方'), ('247', '0046', '海南', '4610', '乐东'), ('248', '0046', '海南', '4611', '临高'), ('249', '0046', '海南', '4612', '陵水'), ('250', '0046', '海南', '4613', '琼海'), ('251', '0046', '海南', '4614', '琼中'), ('252', '0046', '海南', '4615', '屯昌'), ('253', '0046', '海南', '4616', '万宁'), ('254', '0046', '海南', '4617', '文昌'), ('255', '0046', '海南', '4618', '五指山'), ('256', '0046', '海南', '4619', '洋浦'), ('257', '0050', '重庆', '5000', '重庆'), ('258', '0051', '四川', '5101', '成都'), ('259', '0051', '四川', '5102', '巴中'), ('260', '0051', '四川', '5103', '达州'), ('261', '0051', '四川', '5104', '德阳'), ('262', '0051', '四川', '5105', '广安'), ('263', '0051', '四川', '5106', '广元'), ('264', '0051', '四川', '5107', '乐山'), ('265', '0051', '四川', '5108', '凉山'), ('266', '0051', '四川', '5109', '眉山'), ('267', '0051', '四川', '5110', '绵阳'), ('268', '0051', '四川', '5111', '南充'), ('269', '0051', '四川', '5112', '内江'), ('270', '0051', '四川', '5113', '攀枝花'), ('271', '0051', '四川', '5114', '遂宁'), ('272', '0051', '四川', '5115', '雅安'), ('273', '0051', '四川', '5116', '宜宾'), ('274', '0051', '四川', '5117', '自贡'), ('275', '0051', '四川', '5118', '泸州'), ('276', '0051', '四川', '5119', '阿坝'), ('277', '0051', '四川', '5120', '甘孜'), ('278', '0051', '四川', '5121', '资阳'), ('279', '0052', '贵州', '5201', '贵阳'), ('280', '0052', '贵州', '5202', '安顺'), ('281', '0052', '贵州', '5203', '毕节'), ('282', '0052', '贵州', '5204', '六盘水'), ('283', '0052', '贵州', '5205', '铜仁'), ('284', '0052', '贵州', '5206', '遵义'), ('285', '0052', '贵州', '5207', '黔东南'), ('286', '0052', '贵州', '5208', '黔南'), ('287', '0052', '贵州', '5209', '黔西南'), ('288', '0053', '云南', '5301', '昆明'), ('289', '0053', '云南', '5302', '西双版纳'), ('290', '0053', '云南', '5303', '保山'), ('291', '0053', '云南', '5304', '楚雄'), ('292', '0053', '云南', '5305', '大理'), ('293', '0053', '云南', '5306', '德宏'), ('294', '0053', '云南', '5307', '红河'), ('295', '0053', '云南', '5308', '丽江'), ('296', '0053', '云南', '5309', '临沧'), ('297', '0053', '云南', '5310', '怒江'), ('298', '0053', '云南', '5311', '曲靖'), ('299', '0053', '云南', '5312', '思茅'), ('300', '0053', '云南', '5313', '文山'), ('301', '0053', '云南', '5314', '玉溪'), ('302', '0053', '云南', '5315', '昭通'), ('303', '0053', '云南', '5316', '中甸'), ('304', '0053', '云南', '5317', '迪庆州'), ('305', '0054', '西藏', '5401', '拉萨'), ('306', '0054', '西藏', '5402', '阿里'), ('307', '0054', '西藏', '5403', '昌都'), ('308', '0054', '西藏', '5404', '林芝'), ('309', '0054', '西藏', '5405', '那曲'), ('310', '0054', '西藏', '5406', '日喀则'), ('311', '0054', '西藏', '5407', '山南'), ('312', '0061', '陕西', '6101', '西安'), ('313', '0061', '陕西', '6102', '安康'), ('314', '0061', '陕西', '6103', '宝鸡'), ('315', '0061', '陕西', '6104', '汉中'), ('316', '0061', '陕西', '6105', '商洛'), ('317', '0061', '陕西', '6106', '铜川'), ('318', '0061', '陕西', '6107', '渭南'), ('319', '0061', '陕西', '6108', '咸阳'), ('320', '0061', '陕西', '6109', '延安'), ('321', '0061', '陕西', '6110', '榆林'), ('322', '0062', '甘肃', '6201', '兰州'), ('323', '0062', '甘肃', '6202', '白银'), ('324', '0062', '甘肃', '6203', '定西'), ('325', '0062', '甘肃', '6204', '东风'), ('326', '0062', '甘肃', '6205', '合作'), ('327', '0062', '甘肃', '6206', '嘉峪关'), ('328', '0062', '甘肃', '6207', '金昌'), ('329', '0062', '甘肃', '6208', '酒泉'), ('330', '0062', '甘肃', '6209', '矿区'), ('331', '0062', '甘肃', '6210', '临夏'), ('332', '0062', '甘肃', '6211', '陇南'), ('333', '0062', '甘肃', '6212', '平凉'), ('334', '0062', '甘肃', '6213', '庆阳'), ('335', '0062', '甘肃', '6214', '天水'), ('336', '0062', '甘肃', '6215', '武威'), ('337', '0062', '甘肃', '6216', '张掖'), ('338', '0062', '甘肃', '6217', '甘南州'), ('339', '0063', '青海', '6301', '西宁'), ('340', '0063', '青海', '6302', '海东'), ('341', '0064', '宁夏', '6401', '银川'), ('342', '0064', '宁夏', '6402', '中卫'), ('343', '0064', '宁夏', '6403', '固原'), ('344', '0064', '宁夏', '6404', '石嘴山'), ('345', '0064', '宁夏', '6405', '吴忠'), ('346', '0065', '新疆', '6501', '乌鲁木齐'), ('347', '0065', '新疆', '6502', '阿克苏'), ('348', '0065', '新疆', '6503', '阿勒泰'), ('349', '0065', '新疆', '6504', '巴州'), ('350', '0065', '新疆', '6505', '博州'), ('351', '0065', '新疆', '6506', '昌吉'), ('352', '0065', '新疆', '6507', '哈密'), ('353', '0065', '新疆', '6508', '和田'), ('354', '0065', '新疆', '6509', '喀什'), ('355', '0065', '新疆', '6510', '克拉玛依'), ('356', '0065', '新疆', '6511', '马兰'), ('357', '0065', '新疆', '6512', '石河子'), ('358', '0065', '新疆', '6513', '塔城'), ('359', '0065', '新疆', '6514', '吐鲁番'), ('360', '0065', '新疆', '6515', '伊犁'), ('361', '0065', '新疆', '6516', '克州'), ('362', '0065', '新疆', '6517', '阿拉尔'), ('363', '0065', '新疆', '6518', '五家渠'), ('364', '2001', '香港', '9901', '香港'), ('365', '2002', '澳门', '9902', '澳门'), ('366', '2003', '台湾', '9903', '台湾');
COMMIT;